Revit 2025 API
MasonryCMUPatternType Enumeration
 The enumerated type representing the permitted values for the asset property "MasonryCMUPattern" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum MasonryCMUPatternType
Public Enumeration MasonryCMUPatternType
public enum class MasonryCMUPatternType
type MasonryCMUPatternType
Members
Member name | Value | Description
None | 0
Custom | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace